#!/usr/bin/python
# -*- coding: utf-8 -*-

import re

try:
	import __pypy__
	is_pypy = True
except:
	is_pypy = False

regs = []
disableReg = None
disableLib = None

def initFilter():
	global regs
	global disableReg
	global disableLib

	regs = []
	# 以前的敏感正则词库先不管了
	# for reg in regLib:
	# 	regs.append(re.compile(reg))

	disableLib = []
	with open('disable_words.txt', 'rb') as fp:
		disableLib = [x.strip().decode('utf8').lower() for x in fp.readlines() if x]
	for i, x in enumerate(disableLib):
		# print i, x
		# re.compile(x)
		disableLib[i] = x.replace("*", "\\*")
	disableReg = re.compile(u'|'.join(disableLib))

def filterName(uName):
	if len(uName.strip()) != len(uName):
		return True
	if uName.find(r'#') >= 0 or uName.find('\\') >= 0:
		return True

	try:
		uName.encode('gbk')
		uName = uName.lower()
	except:
		return True

	if is_pypy:
		# re slow in pypy
		for x in disableLib:
			if uName.find(x) >= 0:
				return True
	else:
		if disableReg.search(uName):
			return True

	for reg in regs:
		if reg.search(uName):
			return True

	return False

regLib = [
u'^(?!.*(0{6,11}|1{6,11}|2{6,11}|3{6,11}|4{6,11}|5{6,11}|6{6,11}|7{6,11}|8{6,11}|9{6,11})).*(((?<![A-Za-zＡ-Ｚａ-ｚ一-龥])([扣QqｑＱ球讯迅抠鹅叩訊口ね筘+±＋┼┽┾┿╀╁╂╃╋╊╉╈╇╅╄加驾迦戛浃镓痂恝岬跏胛笳珈瘕郏袈蛱傢價叚唊圿埉夓夾婽宊幏徦忦戞扴鴨鸭抸拁拮挈挟挾揳擖斚斝梜椵榎榢槚檟毠泇浹犌猳玾糘耞鉫駕腾ΩΩロуYyｙ￥丫ㄚソゾγУＹΥ丫丫歪](?![A-Za-zＡ-Ｚａ-ｚ一-龥])|[多哆]丶?[^一-龥]*玩|[语語]丶?[^一-龥]*[音]|密丶?[^一-龥]*号|[電电]丶?[^一-龥]*[姡话]|[联聯]丶?[^一-龥]*[繫系]|[频頻]丶?[^一-龥]*[道導]|[帮幫蚣工エュ公]丶?[^一-龥]*[绘会烩荟缋僡儶匯嘒嚖囘囬圚媈廻廽徻恛恵憓懳暉暳會楎槥檅檓櫘毀毇烣煇燬燴獩琿璤璯瞺薈詼譭韢鮰繪燴])).*([\d１２３４５６７８９０⒈⒉⒊⒋⒌⒍⒎⒏⒐ⅠⅡⅢⅣⅤⅥⅦⅧⅨ㈠㈡㈢㈣㈤㈥㈦㈧㈨①②③④⑤⑥⑦⑧⑨⑴⑵⑶⑷⑸⑹⑺⑻⑼一二三四五六七八九零壹贰叁肆伍陆柒捌玖两ooOｏＯ0０oOＯОｏ○〇零〇чㄐｌ]{4,}))',
u'^(?!.*(0{6,11}|1{6,11}|2{6,11}|3{6,11}|4{6,11}|5{6,11}|6{6,11}|7{6,11}|8{6,11}|9{6,11})).*(((?<![A-Za-zＡ-Ｚａ-ｚ一-龥])([联系扣QqｑＱ球讯迅抠鹅叩訊口ね筘+±＋┼┽┾┿╀╁╂╃╋╊╉╈╇╅╄加驾迦戛浃镓痂恝岬跏胛笳珈瘕郏袈蛱傢價叚唊圿埉夓夾婽宊幏徦忦戞扴鴨鸭抸拁拮挈挟挾揳擖斚斝梜椵榎榢槚檟毠泇浹犌猳玾糘耞鉫駕腾ΩΩロYyуｙ￥丫ㄚソゾγУＹΥ丫丫歪]{2,2}|[多哆].?玩|[语語].?[音]|[频頻].?[道導]|密丶?[^一-龥]*号|[電电]丶?[^一-龥]*[姡话]|[联聯]丶?[^一-龥]*[繫系]|[帮幫蚣工エュ公][绘会烩荟缋僡儶匯嘒嚖囘囬圚媈廻廽徻恛恵憓懳暉暳會楎槥檅檓櫘毀毇烣煇燬燴獩琿璤璯瞺薈詼譭韢鮰繪燴])).*([\d１２３４５６７８９０⒈⒉⒊⒋⒌⒍⒎⒏⒐ⅠⅡⅢⅣⅤⅥⅦⅧⅨ㈠㈡㈢㈣㈤㈥㈦㈧㈨①②③④⑤⑥⑦⑧⑨⑴⑵⑶⑷⑸⑹⑺⑻⑼一二三四五六七八九零壹贰叁肆伍陆柒捌玖两ooOｏＯ0０oOＯОｏ○〇零〇чㄐｌ]{4,}))',
u'(?<![A-Za-zＡ-Ｚａ-ｚ])[gＧG]丶?[^A-Za-zＡ-Ｚａ-ｚ０-９0-9一-龥]*[ＭΜm](?![A-Za-zＡ-Ｚａ-ｚ一-龥])',
u'(?<![A-Za-zＡ-Ｚａ-ｚ])n丶?[^A-Za-zＡ-Ｚａ-ｚ０-９0-9一-龥]{0,}e丶?[^A-Za-zＡ-Ｚａ-ｚ０-９0-9一-龥]{0,}t丶?[^A-Za-zＡ-Ｚａ-ｚ０-９0-9一-龥]{0,}e丶?[^A-Za-zＡ-Ｚａ-ｚ０-９0-9一-龥]{0,}a丶?[^A-Za-zＡ-Ｚａ-ｚ０-９0-9一-龥]{0,}s丶?[^A-Za-zＡ-Ｚａ-ｚ０-９0-9一-龥]{0,}e(?![A-Za-zＡ-Ｚａ-ｚ一-龥])',
u'(?<![A-Za-zＡ-Ｚａ-ｚ])[fＦ]丶?[^A-Za-zＡ-Ｚａ-ｚ０-９0-9一-龥]{0,}[uＵ]丶?[^A-Za-zＡ-Ｚａ-ｚ０-９0-9一-龥]{0,}[cＣ]丶?[^A-Za-zＡ-Ｚａ-ｚ０-９0-9一-龥]{0,}[kＫ](?![A-Za-zＡ-Ｚａ-ｚ一-龥])',
u'(?<![A-Za-zＡ-Ｚａ-ｚ])[sＳ]丶?[^A-Za-zＡ-Ｚａ-ｚ０-９0-9一-龥]{0,}[hＨ]丶?[^A-Za-zＡ-Ｚａ-ｚ０-９0-9一-龥]{0,}[iＩ]丶?[^A-Za-zＡ-Ｚａ-ｚ０-９0-9一-龥]{0,}[tＴ](?![A-Za-zＡ-Ｚａ-ｚ一-龥])',
u'(?<![A-Za-zＡ-Ｚａ-ｚ０-９0-9])[⑸⒌5５五⑤㈤武]丶?[^A-Za-zＡ-Ｚａ-ｚ０-９0-9一-龥]*[1⑴⒈１IＩI壹依一一㈠①妖艺药幺]丶?[^A-Za-zＡ-Ｚａ-ｚ０-９0-9一-龥]*[⑺⒎7７柒七七⑦㈦]丶?[^A-Za-zＡ-Ｚａ-ｚ０-９0-9一-龥]*[⑶⒊3３三三叁㈢③山](?![A-Za-zＡ-Ｚａ-ｚ０-９0-9])',
u'联丶?[^一-龥]*系.*[扣QqｑpＱ球讯抠叩扣口ね筘騰摳群裙腾马企鹅圈Yy歪]|[百白佰摆][^一-龥]{0,4}[度渡喥]|[度渡喥][^一-龥]{0,4}娘|[搜叟嗖馊][^一-龥]{0,4}[索溹]|[淘逃桃掏套陶][^A-Za-zＡ-Ｚａ-ｚ一-龥]{0,3}[宝包保饱堡賲寶]',
u'[低高平]丶?[^一-龥]*[价價]|[颁扮]丶?[^一-龥]*[奖奬獎]|[訊讯信消迅]丶?[^一-龥]*息|[传傳]丶?[^一-龥]*[訊讯信]|[音喜咨]丶?[^一-龥]*[讯訊]|[传傳]丶?[^一-龥]*[闻聞信]|[查咨]丶?[^一-龥]*[询詢]|[糸系繫]丶?[^一-龥]*[統统綂]|序丶?[^一-龥]*[列烈咧洌冽例]?(丶?[^一-龥]*)?号|[侧测恻側測惻]丶?[^一-龥]*[试拭式]|[推蓷]丶?[^一-龥]*广|广丶?[^一-龥]*[推蓷]丶?[^一-龥]*[员員]|[公通]丶?[^一-龥]*[告示司]|告丶?[^一-龥]*[知示]|[代带玳帶]丶?[^一-龥]*理|工丶?[^一-龥]*[作做]丶?[^一-龥]*人[员員]',
u'[恭]丶?[^一-龥]*[禧喜]|[兑兌抽發发中]丶?[^一-龥]*[奖奬獎]|惊丶?[^一-龥]*[喜嘻譆]|[發发]丶?[^一-龥]*[放布佈埠]|[提堤]丶?[^一-龥]*[醒示]|[出销銷]丶?[^一-龥]*售|客丶?[^一-龥]*服|宣丶?[^一-龥]*[传傳]|[点點]丶?[^一-龥]*卡|[奖奬獎]丶?[^一-龥]*[勵励]|[运運]丶?[^一-龥]*[維维]|[網网]丶?[^一-龥]*[络絡]|(?<![A-Za-zＡ-Ｚａ-ｚ０-９0-9])[网網WwＷｗ][^A-Za-zＡ-Ｚａ-ｚ０-９0-9一-龥]{0,}丶?之?丶?[^A-Za-zＡ-Ｚａ-ｚ０-９0-9一-龥]{0,}[易YyＹｙ](?![A-Za-zＡ-Ｚａ-ｚ０-９0-9])|[联聯]丶?[^一-龥]*[络絡繫系]|测丶?[^一-龥]*[试試]|在丶?[^一-龥]*线丶?[^一-龥]*活丶?[^一-龥]*动|[新薪]丶?[^一-龥]*手丶?[^一-龥]*物丶?[^一-龥]*品|信丶?[^一-龥]*件|注丶?[^一-龥]*意|[价價]丶?[^一-龥]*格|梦丶?[^一-龥]*幻丶?[^一-龥]*西丶?[^一-龥]*游',
u'金丶?[^一-龥]*币|兼丶?[^一-龥]*职|(?<![A-Za-zＡ-Ｚａ-ｚ])[sSｓＳ]丶?[^A-Za-zＡ-Ｚａ-ｚ一-龥1-9]*[fFｆＦ](?![A-Za-zＡ-Ｚａ-ｚ])|银丶?[^一-龥]*[两子币]|赚丶?[^一-龥]*黑丶?[^一-龥]*钱|巡丶?[^一-龥]*游|序丶?[^一-龥]*[列咧洌烈冽]丶?[^一-龥]*号|天丶?[^一-龥]*官|数丶?[^一-龥]*值|书丶?[^一-龥]*记|用丶?[^一-龥]*户|正丶?[^一-龥]*在丶?[^一-龥]*输丶?[^一-龥]*入|[日曰]本|外丶?[^一-龥]*挂|([密蜜秘]|安丶?[^一-龥]*全)丶?[^一-龥]*([码玛]|石马)|([帐账]|[巾贝]长)丶?[^一-龥]*[号户]',
u'[你泥拟腻逆溺倪尼匿妮霓铌昵坭猊伲怩鲵睨旎伱他它她][^a-zA-Z0-9一-龥]*[老]?[^a-zA-Z0-9一-龥]*([嗲媽嗎馬玛鎷碼奶母父爷爺姐妹公婆酿姥孙姨]|母亲)|[狗淫屎艹]|([装烂骚凸艹]|女马)[屌尻逼屄Bbъ]|[插操][你泥拟腻逆溺倪尼匿妮霓铌昵坭猊伲怩鲵睨旎伱他它她得的进插]|[欠紧抽J鸡我狂][插操]',
u'政丶?[^一-龥]*府|台丶?[^一-龥]*独|天丶?[^一-龥]*皇|共丶?[^一-龥]*产?丶?[^一-龥]*党|黑丶?[^一-龥]*社丶?[^一-龥]*会|黑丶?[^一-龥]*帮|解丶?[^一-龥]*放丶?[^一-龥]*军|皇丶?[^一-龥]*军|共丶?[^一-龥]*和丶?[^一-龥]*[国國]|中丶?[^一-龥]*[国华國華共党]丶?[^一-龥]*[共工]丶?[^一-龥]*[产產浐]丶?[^一-龥]*[党黨裆谠傥]|[国國]丶?[^一-龥]*民丶?[^一-龥]*[党黨裆谠傥]|[党黨裆谠傥]丶?[^一-龥]*中丶?[^一-龥]*[秧央]|台丶?[^一-龥]*[湾弯]|警丶?[^一-龥]*察|公丶?[^一-龥]*安|共丶?[^一-龥]*匪|[国國][^一-龥]{0,10}民[^一-龥]{0,10}[党当黨當]|[东東][^一-龥]{0,10}[亚亞][^一-龥]{0,10}病[^一-龥]{0,10}夫|鬼丶?[^一-龥]*子',
u'[⒊3３三三叁㈢③山][^A-Za-zＡ-Ｚａ-ｚ０-９0-9一-龥]{0,4}石|丁丶?[^一-龥]*磊|张丶?[^一-龥]*国丶?[^一-龥]*荣|[陳陈]丶?[^一-龥]*冠丶?[^一-龥]*希|蒋丶?[^一-龥]*中丶?[^一-龥]*正|蒋丶?[^一-龥]*介丶?[^一-龥]*石|蒋丶?[^一-龥]*经丶?[^一-龥]*国|康丶?[^一-龥]*生|林丶?[^一-龥]*彪|林丶?[^一-龥]*立丶?[^一-龥]*果|张[^一-龥]*春丶?[^一-龥]*桥|姚丶?[^一-龥]*文丶?[^一-龥]*元|薄丶?[^一-龥]*一丶?[^一-龥]*波|陈丶?[^一-龥]*毅|陈丶?[^一-龥]*云|邓丶?[^一-龥]*小丶?[^一-龥]*平|邓丶?[^一-龥]*颖丶?[^一-龥]*超|董丶?[^一-龥]*必丶?[^一-龥]*武|高丶?[^一-龥]*岗|胡丶?[^一-龥]*耀丶?[^一-龥]*邦|华丶?[^一-龥]*国丶?[^一-龥]*锋|胡丶?[^一-龥]*锦丶?[^一-龥]*涛|黄丶?[^一-龥]*菊|贺丶?[^一-龥]*龙|胡丶?[^一-龥]*启丶?[^一-龥]*立|江丶?[^一-龥]*青|江丶?[^一-龥]*泽丶?[^一-龥]*民|贾丶?[^一-龥]*庆丶?[^一-龥]*林|李丶?[^一-龥]*济丶?[^一-龥]*深|李丶?[^一-龥]*先丶?[^一-龥]*念|李丶?[^一-龥]*德丶?[^一-龥]*生|李丶?[^一-龥]*长丶?[^一-龥]*春|李丶?[^一-龥]*鹏|李丶?[^一-龥]*瑞丶?[^一-龥]*环|林丶?[^一-龥]*彪|刘丶?[^一-龥]*少丶?[^一-龥]*奇|刘丶?[^一-龥]*伯丶?[^一-龥]*承|罗丶?[^一-龥]*干|罗丶?[^一-龥]*瑞丶?[^一-龥]*卿|罗丶?[^一-龥]*荣丶?[^一-龥]*桓|聂丶?[^一-龥]*荣丶?[^一-龥]*臻|彭丶?[^一-龥]*德丶?[^一-龥]*怀|彭丶?[^一-龥]*真|乔丶?[^一-龥]*石|任丶?[^一-龥]*弼丶?[^一-龥]*时|荣丶?[^一-龥]*毅丶?[^一-龥]*仁|宋丶?[^一-龥]*庆丶?[^一-龥]*龄|汪丶?[^一-龥]*东丶?[^一-龥]*兴|王丶?[^一-龥]*洪丶?[^一-龥]*文|万丶?[^一-龥]*里|温丶?[^一-龥]*家丶?[^一-龥]*宝|吴丶?[^一-龥]*邦丶?[^一-龥]*国|吴丶?[^一-龥]*官丶?[^一-龥]*正|吴丶?[^一-龥]*仪|王丶?[^一-龥]*震|徐丶?[^一-龥]*向丶?[^一-龥]*前|叶丶?[^一-龥]*剑丶?[^一-龥]*英|杨丶?[^一-龥]*尚丶?[^一-龥]*昆|张丶?[^一-龥]*澜|赵丶?[^一-龥]*紫丶?[^一-龥]*阳|曾丶?[^一-龥]*庆丶?[^一-龥]*红|朱丶?[^一-龥]*德|朱丶?[^一-龥]*镕丶?[^一-龥]*基|[习刁]丶?[^一-龥]*近丶?[^一-龥]*平|李丶?[^一-龥]*克丶?[^一-龥]*强|回丶?[^一-龥]*良丶?[^一-龥]*玉|张丶?[^一-龥]*德丶?[^一-龥]*江|王丶?[^一-龥]*岐丶?[^一-龥]*山|董丶?[^一-龥]*建丶?[^一-龥]*华|毛丶?[^一-龥]*润丶?[^一-龥]*之|赵丶?[^一-龥]*紫丶?[^一-龥]*阳|李丶?[^一-龥]*洪丶?[^一-龥]*志|奥丶?[^一-龥]巴丶?[^一-龥]马|[博薄]丶?[^一-龥]*[西书熙]丶?[^一-龥]*[记来]|周丶?[^一-龥]*永丶?[^一-龥]*[康k]|吴丶?[^一-龥]*邦丶?[^一-龥]*国',
u'毛丶?[^一-龥]*[泽择澤擇主]丶?[^一-龥]*[东東席]|周丶?[^一-龥]*[恩總总]丶?[^一-龥]*[来來理]|[邓鄧]丶?[^一-龥]*小丶?[^一-龥]*平|[刘劉]丶?[^一-龥]*[少绍]丶?[^一-龥]*奇|朱丶?[^一-龥]*德|江丶?[^一-龥]*[择泽擇澤主]丶?[^一-龥]*[民席]|朱丶?[^一-龥]*[镕容荣榮總总]丶?[^一-龥]*[基理]|胡丶?[^一-龥]*[锦錦井主]丶?[^一-龥]*[涛濤席]|[温溫]丶?[^一-龥]*[家總总]丶?[^一-龥]*[宝寶理]|天丶?[^一-龥]*安丶?[^一-龥]*[门門]|李丶?[^一-龥]登丶?[^一-龥][辉輝]|[陈陳][^一-龥]{0,10}水[^一-龥]{0,10}扁|吕[^一-龥]{0,10}秀[^一-龥]{0,10}[莲蓮]|蔡[^一-龥]{0,10}英[^一-龥]{0,10}文|彭丶?[^一-龥]明丶?[^一-龥]敏|[许許]丶?[^一-龥]文丶?[^一-龥][龙龍]|蔡丶?[^一-龥]同丶?[^一-龥][榮荣]|[熱热]丶?[^一-龥]比丶?[^一-龥][亚亞娅]|达丶?[^一-龥][赖賴]丶?[^一-龥]喇丶?[^一-龥]嘛|[东東]丶?[^一-龥]突|藏丶?[^一-龥]青丶?[^一-龥][会會]|世丶?[^一-龥]维丶?[^一-龥][会會]',
u'老丶?[^一-龥]*毛|[阴荫]丶?[^一-龥]*[唇道茎蒂唇毛]|性丶?[^一-龥]*[爱愛交]|做丶?[^一-龥]*[爱愛]|(?<!母)[鸡叽几]丶?[^一-龥]*[鸡巴吧]|[烂傻死煞装]丶?[^A-Za-zＡ-Ｚａ-ｚ０-９0-9一-龥]*[Bb逼笔]|我丶?[^一-龥]*[草艹操靠]|[射卖遗]丶?[^一-龥]*[精爽]|祖丶?[^一-龥]*[先宗]|早丶?[^一-龥]*[泻谢泄]|(月工|肛)丶?[^一-龥]*交|用丶?[^一-龥]*黄丶?[^一-龥]*瓜|阳丶?[^一-龥]*[具痿]|自丶?[^一-龥]*撸|装丶?[^一-龥]*处丶?[^一-龥]*女|猪丶?[^一-龥]*[曰日]|胸丶?[^一-龥]*罩|以丶?[^一-龥]*茎|往丶?[^一-龥]*里丶?[^一-龥]*插|吞丶?[^一-龥]*精|[舔吻亲].*([咪唇道茎蒂唇毛]|((?<!母)[鸡叽几]丶?[^一-龥]*[鸡巴吧]))|[双群]丶?[^一-龥]*乳|生丶?[^一-龥]*殖丶?[^一-龥]*器|生丶?[^一-龥]*成丶?[^一-龥]*器|神丶?[^一-龥]*经丶?[^一-龥]*病|上丶?[^一-龥]*床|(?<![紫蓝暖藍暮红粉桔菊橘])色丶?[^一-龥]*情|骚丶?[^一-龥]*货',
u'[kKｋＫ]丶?[^A-Za-z0-9_一-龥]*粉|[搖摇]丶?[^一-龥]*[頭头]丶?[^一-龥]*丸|海丶?[^一-龥]*洛丶?[^一-龥]*因|[鸦鴉]丶?[^一-龥]*片|可丶?[^一-龥]*卡丶?[^一-龥]*因|冰丶?[^一-龥]*毒|迷丶?[^一-龥]*幻丶?[^一-龥]*[药藥]|迷丶?[^一-龥]*[药藥歼奸]|嗨丶?[^一-龥]*[药藥]|春丶?[^一-龥]*[药藥]',
u'乳丶?[^一-龥]*[罩晕系头沟房]|乳丶?[^一-龥]*来丶?[^一-龥]*伸丶?[^一-龥]*掌|生丶?[^一-龥]*殖丶?[^一-龥]*器|神丶?[^一-龥]*经丶?[^一-龥]*病|舌丶?[^一-龥]*战丶?[^一-龥]*群丶?[^一-龥]*乳|上丶?[^一-龥]*床|骚丶?[^一-龥]*货|三丶?[^一-龥]*级丶?[^一-龥]*片|三丶?[^一-龥]*唑丶?[^一-龥]*仑|肉丶?[^一-龥]*[棍棒]|[日曰]丶?[^一-龥]*妓|日丶?[^一-龥]*理丶?[^一-龥]*万丶?[^一-龥]*鸡|人妖|取精|(强|弓虽|qiang)丶?[^一-龥]*(女干|奸|jian)',
u'((([黄黃皇煌簧璜磺潢篁蟥穔櫎媓獚墴熿鱑hHｈＨaAａＡаАāáǎàɑ]|[yYｙＹ][^A-Za-z0-9_一-龥]{0,6}[eEｅＥ][^A-Za-z0-9_一-龥]{0,6}[lLｌＬ]{2}[^A-Za-z0-9_一-龥]{0,6}[oOｏＯ][^A-Za-z0-9_一-龥]{0,6}[wWｗＷ])[^一-龥]{0,6}(([色涩铯銫]|[sSｓＳ][^A-Za-z0-9_一-龥]{0,6}[eEｅＥēéěèê])[^一-龥]{0,6})?)|[成城大]丶?[^一-龥]*[人魜][^一-龥]{0,6}|[情请箐清青][^一-龥]{0,6}([色涩铯銫]|[sSｓＳ][^A-Za-z0-9_一-龥]{0,6}[eEｅＥēéěèê])[^一-龥]{0,6}|([色涩铯銫]|[sSｓＳ][^A-Za-z0-9_一-龥]{0,6}[eEｅＥēéěèê])[^一-龥]{0,6}[情请箐清青][^一-龥]{0,6}|激[^一-龥]{0,6}[情请箐清青][^一-龥]{0,6}|[aAａＡаАāáǎàɑ][^A-Za-z0-9_一-龥]{0,6}[vVｖＶ片带][^一-龥]{0,6})([罔惘辋網焹棢望蛧輞誷网][^一-龥]{0,6}([戰战站址止芷])?|小?丶?[^一-龥]*电丶?[^一-龥]*影|视丶?[^一-龥]*频|录丶?[^一-龥]*像|[ＭMmｍМΜMм㎡][^A-Za-z0-9_一-龥]{0,6}[oOｏＯōóǒò0０oOＯｏ○〇][^A-Za-z0-9_一-龥]{0,6}[vVｖＶ][^A-Za-z0-9_一-龥]{0,6}[iIｉＩīíǐì][^A-Za-z0-9_一-龥]{0,6}[eEｅＥēéěèê]|[fFｆＦ][^A-Za-z0-9_一-龥]{0,6}[iIｉＩīíǐì][^A-Za-z0-9_一-龥]{0,6}[lLｌＬ][^A-Za-z0-9_一-龥]{0,6}[ＭMmｍМΜMм㎡]|影?丶?[^一-龥]*片)',
u'钓丶?[^一-龥]*鱼丶?[^一-龥]*[槝島嶋岛]|中丶?[^一-龥]*[日曰]丶?[^一-龥]*亲丶?[^一-龥]*善|台丶?[^一-龥]*[日曰]丶?[^一-龥]*共丶?[^一-龥]*荣|[軍军]丶?[^一-龥]*[国國]|大丶?[^一-龥]*和丶?[^一-龥]*民丶?[^一-龥]*族|天丶?[^一-龥]*皇|皇丶?[^一-龥]*军|大丶?[^一-龥]*赦丶?[^一-龥]*[国國]丶?[^一-龥]*[际際]|江丶?[^一-龥]*氏丶?[^一-龥]*(政丶?[^一-龥]*府|集丶?[^一-龥]*[团團])|大丶?[^一-龥]*法丶?[^一-龥]*([学學]丶?[^一-龥]*[员員]|弟丶?[^一-龥]*子)|[玖九9９⒐㈨⑨⑼]丶?[^一-龥]*[评評]丶?[^一-龥]*共丶?[^一-龥]*[产產]丶?[^一-龥]*[党黨]|明丶?[^一-龥]*慧丶?[^一-龥]*[网網]|正丶?[^一-龥]*清丶?[^一-龥]*[网網]|[圆圓]丶?[^一-龥]*明丶?[^一-龥]*[网網]|真丶?[^一-龥]*善丶?[^一-龥]*忍|[帮幫][^一-龥]{0,6}助[^一-龥]{0,6}退[^一-龥]{0,6}[黨党]|共[^一-龥]{0,6}[产產][^一-龥]{0,6}[党黨]|([法珐琺砝鍅]|[fFｆＦ][aAａＡ]|三去)[^一-龥]{0,10}([轮論輪倫侖綸掄淪崙崘惀腀论伦沦仑纶抡囵倫綸綸腀淪]|[lLｌＬ][uUｕＵ][nNｎＮ]|车仑)[^一-龥]{0,10}([宮恭功共攻公宫工达大汏]|[dDｄＤ][aAａＡ])?|(李|[lLｌＬ][iIｉＩ])[^一-龥]{0,10}([洪紅鴻泓红宏鸿弘]|hon?)[^一-龥]{0,10}[志治致旨智]',
u'([tTｔＴ][aAａＡ][iIｉＩ]|[台臺]|藏|疆|突丶?[^一-龥]*厥|西丶?[^一-龥]*藏|[台臺]丶?[^一-龥]*[湾灣]|世丶?[^一-龥]*界丶?[^一-龥]*博丶?[^一-龥]*[览覽]?丶?[^一-龥]*[会會]?)丶?[^一-龥]*([独獨]|[dDｄＤ][uUｕＵ]|[独獨]丶?[^一-龥]*立)',
u'革丶?[^一-龥]*命|抗丶?[^一-龥]*[议議]|示丶?[^一-龥]*威|(([法珐琺砝鍅]|[fFｆＦ][aAａＡ]|三去)丶?[^一-龥]*[西希夕]丶?[^一-龥]*[斯撕嘶])|([fFｆＦ][^A-Za-z0-9_一-龥]*[aAａＡ][^A-Za-z0-9_一-龥]*[sSｓＳ][^A-Za-z0-9_一-龥]{0,3}[cCｃＣ][^A-Za-z0-9_一-龥]{0,3}[iIｉＩ][^A-Za-z0-9_一-龥]{0,3}[sSｓＳ][^A-Za-z0-9_一-龥]{0,3}[tTｔＴ])',
u'(台丶?[^一-龥]*湾|一丶?[^一-龥]*中丶?[^一-龥]*一丶?[^一-龥]*台|藏丶?[^一-龥]*妇丶?[^一-龥]*会|轮丶?[^一-龥]*奸|强丶?[^一-龥]*奸|反丶?[^一-龥]*共|反丶?[^一-龥]*党|暴丶?[^一-龥]*动|赌丶?[^一-龥]*博|开丶?[^一-龥]*房|走丶?[^一-龥]*私|一丶?[^一-龥]*夜丶?[^一-龥]*情|卖丶?[^一-龥]*淫|大丶?[^一-龥]*麻)|身丶?[^一-龥]*份丶?[^一-龥]*证',
u'(喊[^一-龥]{0,6}话|辅[^一-龥]{0,6}助|(跑|砲|走|足包|[pPｐＰㄗ][^A-Za-z0-9_一-龥]{0,6}[aAａＡ][^A-Za-z0-9_一-龥]{0,6}[oOｏＯ])[^一-龥]{0,6}([商啇墒蔏熵尙尚]|[sSｓＳ][^A-Za-z0-9_一-龥]{0,6}[hHｈＨ][^A-Za-z0-9_一-龥]{0,6}[aAａＡ][^A-Za-z0-9_一-龥]{0,6}[nNｎＮ][^A-Za-z0-9_一-龥]{0,6}[gGｇＧ])|跑[^一-龥]{0,6}镖|师[^一-龥]{0,6}门)[^一-龥]{0,6}(器|软[^一-龥]{0,6}件)|[工gGｇＧɡ][^A-Za-z0-9_一-龥]{0,6}[作做zZｚＺ][^A-Za-z0-9_一-龥]{0,6}[室sSｓＳ]|(?<![A-Za-zＡ-Ｚａ-ｚ])[代带玳帶][^A-Za-z0-9_一-龥]{0,6}[练炼刷接连联梿練级lLｌＬ](?![A-Za-zＡ-Ｚａ-ｚ])',
u'([日氜鈤馹驲曰草操曹槽糙懆肏艹蓸]丶?[^a-zA-Z0-9一-龥]*[你泥拟腻逆溺倪尼匿妮霓铌昵坭猊伲怩鲵睨旎伱嫩她塔塌他它]丶?[^a-zA-Z0-9一-龥]*[老]?丶?[^a-zA-Z0-9一-龥]*[吗妈马嘛麻骂码玛蚂唛蟆犸嬷杩亇傌嗎嘜媽嫲嬤孖尛幕木母亩目墓牧穆暮牡拇慕睦姆钼沐砪娘酿妹姐])|([吗妈马嘛麻骂码玛蚂唛蟆犸嬷杩嗎媽碼祃禡馬駡麼麽][^a-zA-Z0-9一-龥]*[了勒]?[的个隔]?[^a-zA-Z0-9一-龥]*[Bb臂比笔闭鼻碧必避逼毕彼鄙壁蓖币弊蔽毙庇敝陛毖痹秕芘匕屄])',
u'车丶?[^一-龥]*仑|女丶?[^一-龥]*马|女丶?[^一-龥]*干|(女丶?[^一-龥]*表|婊)丶?[^一-龥]*子|男丶?[^一-龥]*(女丶?[^一-龥]*支|妓)|奶丶?[^一-龥]*[头子]|某丶?[^一-龥]*人|摸丶?[^一-龥]*[卵奶胸]|破丶?[^一-龥]*处|嫖丶?[^一-龥]*娼|屁丶?[^一-龥]*眼|劈丶?[^一-龥]*胯|千丶?[^一-龥]*鸡丶?[^一-龥]*变|奇丶?[^一-龥]*尺丶?[^一-龥]*大丶?[^一-龥]*乳|裸丶?[^一-龥]*体|撸丶?[^一-龥]*管|刘丶?[^一-龥]*亦丶?[^一-龥]*菲|两丶?[^一-龥]*腿丶?[^一-龥]*之?丶?[^一-龥]*间|老丶?[^一-龥]*衲丶?[^一-龥]*又?丶?[^一-龥]*射|裤丶?[^一-龥]*裆|六丶?[^一-龥]*合丶?[^一-龥]*彩|[抠贱蠢]丶?[^一-龥]*[Bb逼]|九丶?[^一-龥]*阴丶?[^一-龥]*争丶?[^一-龥]*茎|[精茎]丶?[^一-龥]*[射缸肛]|奸丶?[^一-龥]*情|甲丶?[^一-龥]*基丶?[^一-龥]*苯丶?[^一-龥]*丙丶?[^一-龥]*胺|佳丶?[^一-龥]*阴|互丶?[^一-龥]*撸丶?[^一-龥]*娃|黑丶?[^一-龥]*木丶?[^一-龥]*耳|好丶?[^一-龥]*湿|龟丶?[^一-龥]*田|龟丶?[^一-龥]*孙丶?[^一-龥]*子|睾丶?[^一-龥]*丸|睾丶?[^一-龥]*大丶?[^一-龥]*阴|高丶?[^一-龥]*潮|非丶?[^一-龥]*法丶?[^一-龥]*角丶?[^一-龥]*色[明名]|犯丶?[^一-龥]*贱|叼丶?[^一-龥]*[你毛]|弟丶?[^一-龥]*大丶?[^一-龥]*勿丶?[^一-龥]*勃|登丶?[^一-龥]*陆丶?[^一-龥]*页丶?[^一-龥]*面|蛋丶?[^一-龥]*疼|戴丶?[^一-龥]*套|大丶?[^一-龥]*麻|打丶?[^一-龥]*胎|打丶?[^一-龥]*飞丶?[^一-龥]*机|催丶?[^一-龥]*情丶?[^一-龥]*药|吹丶?[^一-龥]*箫|床丶?[^一-龥]*技|穿丶?[^一-龥]*精丶?[^一-龥]*待丶?[^一-龥]*阴|吃丶?[^一-龥]*屎|苍丶?[^一-龥]*井丶?[^一-龥]*空|爆丶?[^一-龥]*[菊肛]|爱丶?[^一-龥]*阴丶?[^一-龥]*湿丶?[^一-龥]*毯|父丶?[^一-龥]*亲',
u'[绝絕]丶?[^一-龥]*技|秘丶?[^一-龥]*籍|[欠被千万]人[日氜鈤馹驲曰草操曹槽糙懆肏艹蓸骑]|(代丶?[^一-龥]*[练炼刷接连联梿練级]|承丶?[^一-龥]*接).*(巧丶?[^一-龥]*燕|跑丶?[^一-龥]*[商墒])',
u'\d{2,5}[ＷWw万银两元园寶圆員園圓芫圜员圆沅][＝=\-等比]\d{2,5}[ＷWw万银两元园寶圆員園圓芫圜员圆沅]|盗[号甩]',
u'风[^一-龥]*暴[^一-龥]*乱[^一-龥]*斗|风[^一-龥]*暴[^一-龥]*小?[^一-龥]*(秘[^一-龥]*[书書]|心[^一-龥]*情|贴[^一-龥]*士)|官[^一-龥]*[网網方]|[禮礼][^一-龥]*[包]|抽[^一-龥]*[取选]|回[^一-龥]*馈|好[^一-龥]*[礼禮]|策[^一-龥]*划|周[^一-龥]*年[^一-龥]*庆|庆[^一-龥]*周[^一-龥]*年|兑[^一-龥]*[换換]|颁[^一-龥]*[发發]|官[^一-龥]*方|开[^一-龥]*[发發髪][^一-龥]*组|服务|大[^一-龥]*使|管丶?[^一-龥]*理丶?[^一-龥]*人?(丶?[^一-龥]*)?[员員]?',
u'(喊[^一-龥]{0,6}话|辅[^一-龥]{0,6}助|(跑|砲|走|足包|[pPｐＰㄗ][^A-Za-z0-9_一-龥]{0,6}[aAａＡ][^A-Za-z0-9_一-龥]{0,6}[oOｏＯ])[^一-龥]{0,6}([商啇墒蔏熵尙尚]|[sSｓＳ][^A-Za-z0-9_一-龥]{0,6}[hHｈＨ][^A-Za-z0-9_一-龥]{0,6}[aAａＡ][^A-Za-z0-9_一-龥]{0,6}[nNｎＮ][^A-Za-z0-9_一-龥]{0,6}[gGｇＧ])|跑[^一-龥]{0,6}镖|师[^一-龥]{0,6}门)[^一-龥]{0,6}(器|软[^一-龥]{0,6}件)|[工gGｇＧɡ][^A-Za-z0-9_一-龥]{0,6}[作做zZｚＺ][^A-Za-z0-9_一-龥]{0,6}[室sSｓＳ]|(?<![A-Za-zＡ-Ｚａ-ｚ])([代蚮带玳帶dD]|dai)[^A-Za-z0-9_一-龥]{0,6}[练炼刷接孕连联梿煉練级lLｌＬ](?![A-Za-zＡ-Ｚａ-ｚ])',
u'运[^一-龥]*维|游[^一-龥]*戏|巡[^一-龥]*游[^一-龥]*天[^一-龥]*官|巡[^一-龥]*游|系[^一-龥]*统|网[^一-龥]*易|网[^一-龥]*之[^一-龥]*易|工[^一-龥]*作[^一-龥]*人[^一-龥]*员|管[^一-龥]*埋|开[^一-龥]*发|客[^一-龥]*服|天[^一-龥]*官|执[^一-龥]*事[^一-龥]*星[^一-龥]*君|大[^一-龥]*唐[^一-龥]*豪[^一-龥]*侠|梦[^一-龥]*幻[^一-龥]*西[^一-龥]*游|大[^一-龥]*话[^一-龥]*西[^一-龥]*游|外[^一-龥]*传|全[^一-龥]*体[^一-龥]*公[^一-龥]*会[^一-龥]*成[^一-龥]*员|员[^一-龥]*[零一二三四五六七八九十]|推[^一-龥]*广|销[^一-龥]*售|序[^一-龥]*[列号]|宣[^一-龥]*传|[颁抽兑中颁发][^一-龥]*[奖布放]|程[^一-龥]*序|测[^一-龥]*试|[帐账][^一-龥]*[号户]|大[^一-龥]*使|网[^一-龥]*络',
u'[⑸⒌5５五⑤㈤武][^一-龥0-9０-９ａ-ｚＡ-ＺA-Za-z]*[1⑴⒈１IＩI壹依一一㈠①妖艺药幺][^一-龥0-9０-９ａ-ｚＡ-ＺA-Za-z]*[⑺⒎7７柒七七⑦㈦][^一-龥0-9０-９ａ-ｚＡ-ＺA-Za-z]*[⑶⒊3３三三叁㈢③山]',
u'(?<![A-Za-zＡ-Ｚａ-ｚ])[gｇＧG]丶?[^A-Za-zＡ-Ｚａ-ｚ０-９0-9一-龥]*[ＭΜmｍM](?![A-Za-zＡ-Ｚａ-ｚ一-龥])',
u'(淘[^一-龥]*宝|腾[^一-龥]*讯).*([号售卖买收]|交[^一-龥]*易)|([号售卖买收]|交[^一-龥]*易).*(淘[^一-龥]*宝|腾[^一-龥]*讯)|[Tt][^一-龥0-9０-９ａ-ｚＡ-ＺA-Za-z]{0,}[Bb][^一-龥0-9０-９ａ-ｚＡ-ＺA-Za-z]{0,}[卖买收售]',
u'国[^一-龥]*家[^一-龥]*机[^一-龥]*关|公[^一-龥]*安|国[^一-龥]*务[^一-龥]*院|解[^一-龥]*放[^一-龥]*军|警[^一-龥]*察|书[^一-龥]*记|政[^一-龥]*府|主[^一-龥]*席|总[^一-龥]*理|中[^一-龥]*央|文[^一-龥]*化[^一-龥]*局|天[^一-龥]*安[^一-龥]*门|版[^一-龥]*署',
u'[公告][^一-龥]*[示告]|活[^一-龥]*动|点[^一-龥]*卡|奖[^一-龥]*励|提[^一-龥]*示|提[^一-龥]*醒|温[^一-龥]*馨|消[^一-龥]*息|信[^一-龥]*息|在[^一-龥]*线|赠[^一-龥]*送|名[^一-龥]*字|诈[^一-龥]*骗|外[^一-龥]*挂|平[^一-龥]*价|批[^一-龥]*发|价[^一-龥]*格|公[^一-龥]*司|高[^一-龥]*价|服[^一-龥]*务|低[^一-龥]*价|出[^一-龥]*售|彩[^一-龥]*票',
u'收[^一-龥]*梦[^一-龥]*幻[^一-龥]*币|收[^一-龥]*钱|实[^一-龥]*卡|[秘蜜密][^一-龥]*[码玛]|免[^一-龥]*费|卖[^一-龥]*木[^一-龥]*马|卖[^一-龥]*软[^一-龥]*件|安[^一-龥]*全[^一-龥]*玛|信[^一-龥]*封|信[^一-龥]*箱|无[^一-龥]*需[^一-龥]*冲[^一-龥]*卡|元[^一-龥]*包[^一-龥]*月|洗[^一-龥]*号|[遊游][^一-龥]*[戲戏][^一-龥ａ-ｚＡ-ＺA-Za-z]*[Bb币笔]|收[^一-龥ａ-ｚＡ-ＺA-Za-z]*H[^一-龥ａ-ｚＡ-ＺA-Za-z]*M[^一-龥ａ-ｚＡ-ＺA-Za-z]*B',
u'(?<![ａ-ｚＡ-ＺA-Za-z])((?i)n[^一-龥ａ-ｚＡ-ＺA-Za-z]*e[^一-龥ａ-ｚＡ-ＺA-Za-z]*t[^一-龥ａ-ｚＡ-ＺA-Za-z]*e[^一-龥ａ-ｚＡ-ＺA-Za-z]*a[^一-龥ａ-ｚＡ-ＺA-Za-z]*s[^一-龥ａ-ｚＡ-ＺA-Za-z]*e|(?i)M[^一-龥ａ-ｚＡ-ＺA-Za-z]*A[^一-龥ａ-ｚＡ-ＺA-Za-z]*S[^一-龥ａ-ｚＡ-ＺA-Za-z]*T[^一-龥ａ-ｚＡ-ＺA-Za-z]*E[^一-龥ａ-ｚＡ-ＺA-Za-z]*R|(?i)A[^一-龥ａ-ｚＡ-ＺA-Za-z]*D[^一-龥ａ-ｚＡ-ＺA-Za-z]*M[^一-龥ａ-ｚＡ-ＺA-Za-z]*I[^一-龥ａ-ｚＡ-ＺA-Za-z]*N)(?![ａ-ｚＡ-ＺA-Za-z])',
u'^(?!.*(.)\1{3,})[QqqｑＱ扣寇抠歪ＹYyｙУ歪]{1,}群?[\d]{5,15}(?!\d)',
u'[帛淿][^一-龥]*[寿涛涛]|薄[^一-龥]*([督胡王温]|熙[^一-龥]*永)|蔡[^一-龥]*(赴[^一-龥]*朝|家[^一-龥]*东|明[^一-龥]*杰)|g[^一-龥0-9０-９ａ-ｚＡ-ＺA-Za-z]*c[^一-龥0-9０-９ａ-ｚＡ-ＺA-Za-z]*党|g[^一-龥0-9０-９ａ-ｚＡ-ＺA-Za-z]*o[^一-龥0-9０-９ａ-ｚＡ-ＺA-Za-z]*n[^一-龥0-9０-９ａ-ｚＡ-ＺA-Za-z]*g[^一-龥0-9０-９ａ-ｚＡ-ＺA-Za-z]*产|g[^一-龥0-9０-９ａ-ｚＡ-ＺA-Za-z]*产[^一-龥0-9０-９ａ-ｚＡ-ＺA-Za-z]*d|g[^一-龥0-9０-９ａ-ｚＡ-ＺA-Za-z]*产[^一-龥]*党|g党|d[^一-龥0-9０-９ａ-ｚＡ-ＺA-Za-z]*的[^一-龥]*领[^一-龥]*导|g[^一-龥0-9０-９ａ-ｚＡ-ＺA-Za-z]*匪',
u'([法珐琺砝鍅]|[fFｆＦ][aAａＡ]|三去)[^一-龥]{0,10}([轮論輪倫侖綸掄淪崙崘惀腀论伦沦仑纶抡囵倫綸綸腀淪]|[lLｌＬ][uUｕＵ][nNｎＮ]|车仑)[^一-龥]{0,10}([宮恭功共攻公宫工达大汏]|[dDｄＤ][aAａＡ])',
u'(李|[lLｌＬ][iIｉＩ])[^一-龥]{0,10}([洪紅鴻泓红宏鸿弘]|hon?)[^一-龥]{0,10}[志治致旨智]',
u'钓[^一-龥]*鱼[^一-龥]*[槝島嶋岛].*日本|日本.*(钓鱼|钓[^一-龥]*鱼[^一-龥]*[槝島嶋岛])|中日亲善|台日共荣|大[^一-龥]*[日曰][^一-龥]*本',
u'(日[^一-龥]*本|[帝軍军][^一-龥]{0,6}[国國]|主[^一-龥]*义|大和民族|天皇|皇军)[^一-龥]*(万[^一-龥]*[岁歲]|必胜|强大|最强)',
u'大[^一-龥]{0,6}赦[^一-龥]{0,6}[国國][^一-龥]{0,6}[际際]|江[^一-龥]{0,6}氏(政[^一-龥]{0,6}府|集[^一-龥]{0,6}[团團])|大[^一-龥]{0,6}法([学學][^一-龥]{0,6}[员員]|弟[^一-龥]{0,6}子)|[玖九9９⒐㈨⑨⑼][^一-龥]{0,6}[评評][^一-龥]{0,6}共[^一-龥]{0,6}[产產][^一-龥]{0,6}[党黨]|明[^一-龥]{0,6}慧[^一-龥]{0,6}[网網]|正[^一-龥]{0,6}清[^一-龥]{0,6}[网網]|[圆圓][^一-龥]{0,6}明[^一-龥]{0,6}[网網]|真[^一-龥]{0,6}善[^一-龥]{0,6}忍|[转轉][^一-龥]{0,6}([法珐琺砝鍅]|[fFｆＦ][aAａＡ]|三去)[^一-龥]{0,6}([轮論輪倫侖綸掄淪崙崘惀腀论伦沦仑纶抡囵倫綸綸腀淪]|[lLｌＬ][uUｕＵ][nNｎＮ]|车仑)|[帮幫][^一-龥]{0,6}助[^一-龥]{0,6}退[^一-龥]{0,6}[黨党]|被[^一-龥]{0,6}共[^一-龥]{0,6}[产產][^一-龥]{0,6}[党黨]',
u'([tTｔＴ][aAａＡ][iIｉＩ]|[台臺]|藏|疆|自[^一-龥]{0,3}由|突[^一-龥]{0,3}厥|西[^一-龥]{0,3}藏|[台臺][^一-龥]{0,3}[湾灣]|世[^一-龥]{0,3}界?博([^一-龥]{0,3}[览覽])?([^一-龥]{0,3}[会會])?)[^一-龥]{0,10}([独獨]|[dDｄＤ][uUｕＵ]|[独獨][^一-龥]{0,3}立|革[^一-龥]{0,3}命|西[^一-龥]{0,3}藏|局[^一-龥]{0,3}势|中[^一-龥]{0,3}[断斷]|抗[^一-龥]{0,3}[议議]|示[^一-龥]{0,3}威)|[国國][^一-龥]{0,10}民[^一-龥]{0,10}[党当黨當]|[东東][^一-龥]{0,10}[亚亞][^一-龥]{0,10}病[^一-龥]{0,10}夫|(日[^一-龥]{0,3}本|大[^一-龥]{0,3}和)[^一-龥]{0,10}(鬼[^一-龥]{0,3}子|帝[^一-龥]{0,3}[国國]|天[^一-龥]{0,3}皇|民[^一-龥]{0,3}族)',
u'((共[^一-龥]{0,6}[产產][^一-龥]{0,6}[党黨])|(政[^一-龥]{0,6}府)|([中肿][^一-龥]{0,6}共)).*(邪[^一-龥]{0,6}恶|拉[^一-龥]{0,6}拢|暴[^一-龥]{0,6}力|诡[^一-龥]{0,6}变|暴[^一-龥]{0,6}政|本[^一-龥]{0,6}性|杀[^一-龥]{0,6}人|煽[^一-龥]{0,6}动|统[^一-龥]{0,6}治|本[^一-龥]{0,6}质|迫[^一-龥]{0,6}害|人[^一-龥]{0,6}权|退[^一-龥]{0,6}出|起[^一-龥]{0,6}家|权[^一-龥]{0,6}力|民[^一-龥]{0,6}主|暴[^一-龥]{0,6}行|黑[^一-龥]{0,6}社[^一-龥]{0,6}会[^一-龥]{0,6}化|病[^一-龥]{0,6}态|封[^一-龥]{0,6}锁|滥[^一-龥]{0,6}用)',
u'([爆去操潮抄叼刁掉干幹靠透插日摸丢吊草搞超朝曹滚曰打]|([车車][仑侖]|弓虽|[轮輪]|[强強])[^一-龥]{0,6}(女干|奸).{0,2})[^一-龥]{0,6}中[^一-龥]{0,6}[国华國華]|(日[^一-龥]{0,6}本|[帝军軍][^一-龥]{0,6}[国國]|主[^一-龥]{0,6}[义義]|大和民族|天皇|皇[军軍]).{0,5}(万[^一-龥]{0,6}[岁歲]|[爱愛])',
u'毛[^一-龥]{0,10}[泽择澤擇主][^一-龥]{0,10}[东東席]|周[^一-龥]{0,10}[恩總总][^一-龥]{0,10}[来來理]|[邓鄧][^一-龥]{0,10}小[^一-龥]{0,10}平|[刘劉][^一-龥]{0,10}[少绍][^一-龥]{0,10}奇|朱[^一-龥]{0,10}德|江[^一-龥]{0,10}[择泽擇澤主][^一-龥]{0,10}[民席]|朱[^一-龥]{0,10}[镕容荣榮總总][^一-龥]{0,10}[基理]|胡[^一-龥]{0,10}[锦錦井主][^一-龥]{0,10}[涛濤席]|[温溫][^一-龥]{0,10}[家總总][^一-龥]{0,10}[宝寶理]|天[^一-龥]{0,10}安[^一-龥]{0,10}[门門]',
u'李[^一-龥]{0,10}登[^一-龥]{0,10}[辉輝]|[陈陳][^一-龥]{0,10}水[^一-龥]{0,10}扁|吕[^一-龥]{0,10}秀[^一-龥]{0,10}[莲蓮]|蔡[^一-龥]{0,10}英[^一-龥]{0,10}文|彭[^一-龥]{0,10}明[^一-龥]{0,10}敏|[许許][^一-龥]{0,10}文[^一-龥]{0,10}[龙龍]|蔡[^一-龥]{0,10}同[^一-龥]{0,10}[榮荣]|[熱热][^一-龥]{0,10}比[^一-龥]{0,10}[亚亞娅]|达[^一-龥]{0,10}[赖賴][^一-龥]{0,10}喇[^一-龥]{0,10}嘛|[东東][^一-龥]{0,10}突|藏[^一-龥]{0,10}青[^一-龥]{0,10}[会會]|世[^一-龥]{0,10}维[^一-龥]{0,10}[会會]',
u'^(?=.*新[^一-龥]{0,5}疆).*([网網][^一-龥]{0,3}[络絡]|[权權][^一-龥]{0,3}利|人[^一-龥]{0,3}[权權]|限[^一-龥]{0,3}制|[开開][^一-龥]{0,3}通|通[^一-龥]{0,3}[网網]|[赔补賠補][^一-龥]{0,3}[偿償])',
u'(([法珐琺砝鍅]|[fFｆＦ][aAａＡ]|三去)[^一-龥]{0,6}[西希夕][^一-龥]{0,6}[斯撕嘶])|([fFｆＦ][^A-Za-z0-9_一-龥]{0,3}[aAａＡ][^A-Za-z0-9_一-龥]{0,3}[sSｓＳ][^A-Za-z0-9_一-龥]{0,3}[cCｃＣ][^A-Za-z0-9_一-龥]{0,3}[iIｉＩ][^A-Za-z0-9_一-龥]{0,3}[sSｓＳ][^A-Za-z0-9_一-龥]{0,3}[tTｔＴ])',
u'([⒈-⒛\.點点。·．,丶` ])+[^一-龥]{0,20}([^A-Za-z0-9_一-龥]?(([aAａＡаАāáǎàɑ][^A-Za-z0-9_一-龥]{0,3}[eEｅＥēéěèê][^A-Za-z0-9_一-龥]{0,3}[rRｒＲ][^A-Za-z0-9_一-龥]{0,3}[oOｏＯōóǒò0０oOＯｏ○〇](?![A-Za-zＡ-Ｚａ-ｚ])|[aAａＡаАāáǎàɑ][^A-Za-z0-9_一-龥]{0,3}[rRｒＲ][^A-Za-z0-9_一-龥]{0,3}[pPｐＰ][^A-Za-z0-9_一-龥]{0,3}[aAａＡаАāáǎàɑ](?![A-Za-zＡ-Ｚａ-ｚ])|[bBｂＢ][^A-Za-z0-9_一-龥]{0,3}[iIｉＩīíǐì][^A-Za-z0-9_一-龥]{0,3}[zZｚＺ](?![A-Za-zＡ-Ｚａ-ｚ])|[℃ｃcCＣсСＧて][^A-Za-z0-9_一-龥]{0,3}[oOｏＯōóǒò0０oOＯｏ○〇][^A-Za-z0-9_一-龥]{0,3}[ＭMmｍМΜMм㎡](?![A-Za-zＡ-Ｚａ-ｚ])|[℃ｃcCＣсСＧて][^A-Za-z0-9_一-龥]{0,3}[oOｏＯōóǒò0０oOＯｏ○〇][^A-Za-z0-9_一-龥]{0,3}[oOｏＯōóǒò0０oOＯｏ○〇][^A-Za-z0-9_一-龥]{0,3}[pPｐＰ](?![A-Za-zＡ-Ｚａ-ｚ])|[eEｅＥēéěèê][^A-Za-z0-9_一-龥]{0,3}[dDｄＤ][^A-Za-z0-9_一-龥]{0,3}[uUｕＵūúǔùǖǘǚǜü](?![A-Za-zＡ-Ｚａ-ｚ])|[gGｇＧɡ][^A-Za-z0-9_一-龥]{0,3}[oOｏＯōóǒò0０oOＯｏ○〇][^A-Za-z0-9_一-龥]{0,3}[vVｖＶ](?![A-Za-zＡ-Ｚａ-ｚ])|[iIｉＩīíǐì][^A-Za-z0-9_一-龥]{0,3}[nNｎＮńň][^A-Za-z0-9_一-龥]{0,3}[fFｆＦ][^A-Za-z0-9_一-龥]{0,3}[oOｏＯōóǒò0０oOＯｏ○〇](?![A-Za-zＡ-Ｚａ-ｚ])|[iIｉＩīíǐì][^A-Za-z0-9_一-龥]{0,3}[nNｎＮńň][^A-Za-z0-9_一-龥]{0,3}[tTｔＴ](?![A-Za-zＡ-Ｚａ-ｚ])|[jJｊＪ][^A-Za-z0-9_一-龥]{0,3}[oOｏＯōóǒò0０oOＯｏ○〇][^A-Za-z0-9_一-龥]{0,3}[bBｂＢ][^A-Za-z0-9_一-龥]{0,3}[sSｓＳ](?![A-Za-zＡ-Ｚａ-ｚ])|[ＭMmｍМΜMм㎡][^A-Za-z0-9_一-龥]{0,3}[uUｕＵūúǔùǖǘǚǜü][^A-Za-z0-9_一-龥]{0,3}[sSｓＳ][^A-Za-z0-9_一-龥]{0,3}[eEｅＥēéěèê][^A-Za-z0-9_一-龥]{0,3}[uUｕＵūúǔùǖǘǚǜü][^A-Za-z0-9_一-龥]{0,3}[ＭMmｍМΜMм㎡](?![A-Za-zＡ-Ｚａ-ｚ])|[nNｎＮńň][^A-Za-z0-9_一-龥]{0,3}[aAａＡаАāáǎàɑ][^A-Za-z0-9_一-龥]{0,3}[ＭMmｍМΜMм㎡][^A-Za-z0-9_一-龥]{0,3}[eEｅＥēéěèê](?![A-Za-zＡ-Ｚａ-ｚ])|[nNｎＮńň][^A-Za-z0-9_一-龥]{0,3}[aAａＡаАāáǎàɑ][^A-Za-z0-9_一-龥]{0,3}[tTｔＴ][^A-Za-z0-9_一-龥]{0,3}[oOｏＯōóǒò0０oOＯｏ○〇](?![A-Za-zＡ-Ｚａ-ｚ])|[nNｎＮńň][^A-Za-z0-9_一-龥]{0,3}[eEｅＥēéěèê][^A-Za-z0-9_一-龥]{0,3}[tTｔＴ](?![A-Za-zＡ-Ｚａ-ｚ])|[oOｏＯōóǒò0０oOＯｏ○〇][^A-Za-z0-9_一-龥]{0,3}[rRｒＲ][^A-Za-z0-9_一-龥]{0,3}[gGｇＧɡ](?![A-Za-zＡ-Ｚａ-ｚ])|[pPｐＰ][^A-Za-z0-9_一-龥]{0,3}[rRｒＲ][^A-Za-z0-9_一-龥]{0,3}[oOｏＯōóǒò0０oOＯｏ○〇](?![A-Za-zＡ-Ｚａ-ｚ])|[tTｔＴ][^A-Za-z0-9_一-龥]{0,3}[rRｒＲ][^A-Za-z0-9_一-龥]{0,3}[aAａＡаАāáǎàɑ][^A-Za-z0-9_一-龥]{0,3}[vVｖＶ][^A-Za-z0-9_一-龥]{0,3}[eEｅＥēéěèê][^A-Za-z0-9_一-龥]{0,3}[lLｌＬ](?![A-Za-zＡ-Ｚａ-ｚ])|[lLｌＬ][^A-Za-z0-9_一-龥]{0,3}[aAａＡаАāáǎàɑ](?![A-Za-zＡ-Ｚａ-ｚ])|[℃ｃcCＣсСＧて][^A-Za-z0-9_一-龥]{0,3}[nNｎＮńň](?![A-Za-zＡ-Ｚａ-ｚ]))))',
u'(外[^一-龥]*挂)|(^(?!(.*[cCｃＣ][^一-龥0-9０-９ａ-ｚＡ-ＺA-Za-z]*[sSｓＳ])).*[私俬ㄥム厶仕四嗣斯４思厮司丝似]丶?[^一-龥]*[服服菔棴箙幅福符俯浮府]|[sSｓＳ][^A-Za-zＡ-Ｚａ-ｚ一-龥1-9]*[fFｆＦ])|((喊[^一-龥]*话|辅[^一-龥]*助|(跑|砲|走|足包|[pPｐＰㄗ][^一-龥0-9０-９ａ-ｚＡ-ＺA-Za-z]*[aAａＡ][^A-Za-z0-9_一-龥]*[oOｏＯ])[^一-龥]*([商啇墒蔏熵尙尚]|[sSｓＳ][^A-Za-z0-9_一-龥]*[hHｈＨ][^A-Za-z0-9_一-龥]*[aAａＡ][^A-Za-z0-9_一-龥]*[nNｎＮ][^A-Za-z0-9_一-龥]*[gGｇＧ])|跑[^一-龥]*镖|师[^一-龥]*门)[^一-龥]*(器|软[^一-龥]*件))',
u'[工gGｇＧɡ][^A-Za-z0-9_一-龥]{0,6}[作做zZｚＺ][^A-Za-z0-9_一-龥]{0,6}[室sSｓＳ]|[代dDｄＤ][^A-Za-z0-9_一-龥]{0,6}[练lLｌＬ][^A-Za-z0-9_一-龥]{0,6}[室sSｓＳ]',
u'(亚克西|(跑|砲|走|足包|[pPｐＰㄗ][^A-Za-z0-9_一-龥]{0,6}[aAａＡ][^A-Za-z0-9_一-龥]{0,6}[oOｏＯ])[^一-龥]{0,6}([商啇墒蔏熵尙尚]|[sSｓＳ][^A-Za-z0-9_一-龥]{0,6}[hHｈＨ][^A-Za-z0-9_一-龥]{0,6}[aAａＡ][^A-Za-z0-9_一-龥]{0,6}[nNｎＮ][^A-Za-z0-9_一-龥]{0,6}[gGｇＧ])|蚮.?跑|玳.?连|脱.*[Ww万]|[練煉练涟莲链].?[笈级圾汲极芨笈]).*((([扣QqｑＱ球讯抠鹅叩訊口ね筘商@ρpｐ號呺℡о].{0,7}([\d１２３４５６７８９０⒈⒉⒊⒋⒌⒍⒎⒏⒐ⅠⅡⅢⅣⅤⅥⅦⅧⅨ㈠㈡㈢㈣㈤㈥㈦㈧㈨①②③④⑤⑥⑦⑧⑨⑴⑵⑶⑷⑸⑹⑺⑻⑼一二三四五六七八九零壹贰叁肆伍陆柒捌玖〇чㄐｌ]){6,9}))|([電电].?[姡话])|密号)',
u'(^\s*\[系统\][：:])|(系[^A-Za-z0-9_一-龥]{0,6}统[^A-Za-z0-9_一-龥]{0,6}消[^A-Za-z0-9_一-龥]{0,6}息)',
u'[kKｋＫ][^A-Za-z0-9_一-龥]{0,6}粉|[搖摇][^A-Za-z0-9_一-龥]{0,6}[頭头][^A-Za-z0-9_一-龥]{0,6}丸|海[^A-Za-z0-9_一-龥]{0,6}洛[^A-Za-z0-9_一-龥]{0,6}因|[鸦鴉][^A-Za-z0-9_一-龥]{0,6}片|可[^A-Za-z0-9_一-龥]{0,6}卡[^A-Za-z0-9_一-龥]{0,6}因|冰[^A-Za-z0-9_一-龥]{0,6}毒|迷[^A-Za-z0-9_一-龥]{0,6}幻[^A-Za-z0-9_一-龥]{0,6}[药藥]|迷[^A-Za-z0-9_一-龥]{0,6}[药藥]|嗨[^A-Za-z0-9_一-龥]{0,6}[药藥]|春[^A-Za-z0-9_一-龥]{0,6}[药藥]',
u'([密蜜秘]|安[^一-龥]{0,6}全)[^一-龥]{0,6}([码玛]|石马)|([帐账]|[巾贝]长)[^一-龥]{0,6}[号户]',
u'((([黄黃皇煌簧璜磺潢篁蟥穔櫎媓獚墴熿鱑hHｈＨaAａＡаАāáǎàɑ]|[yYｙＹ][^A-Za-z0-9_一-龥]{0,6}[eEｅＥ][^A-Za-z0-9_一-龥]{0,6}[lLｌＬ]{2}[^A-Za-z0-9_一-龥]{0,6}[oOｏＯ][^A-Za-z0-9_一-龥]{0,6}[wWｗＷ])[^一-龥]{0,6}(([色涩铯銫]|[sSｓＳ][^A-Za-z0-9_一-龥]{0,6}[eEｅＥēéěèê])[^一-龥]{0,6})?)|[成城大][^一-龥]{0,6}[人魜][^一-龥]{0,6}|[情请箐清青][^一-龥]{0,6}([色涩铯銫]|[sSｓＳ][^A-Za-z0-9_一-龥]{0,6}[eEｅＥēéěèê])[^一-龥]{0,6}|([色涩铯銫]|[sSｓＳ][^A-Za-z0-9_一-龥]{0,6}[eEｅＥēéěèê])[^一-龥]{0,6}[情请箐清青][^一-龥]{0,6}|激[^一-龥]{0,6}[情请箐清青][^一-龥]{0,6}|[aAａＡаАāáǎàɑ][^A-Za-z0-9_一-龥]{0,6}[vVｖＶ片带][^一-龥]{0,6})[罔惘辋網焹棢望蛧輞誷网][^一-龥]{0,6}([戰战站址止芷])?',
u'((([黄黃皇煌簧璜磺潢篁蟥穔櫎媓獚墴熿鱑hHｈＨaAａＡаАāáǎàɑ]|[yYｙＹ][^A-Za-z0-9_一-龥]{0,6}[eEｅＥ][^A-Za-z0-9_一-龥]{0,6}[lLｌＬ]{2}[^A-Za-z0-9_一-龥]{0,6}[oOｏＯ][^A-Za-z0-9_一-龥]{0,6}[wWｗＷ])[^一-龥]{0,6}(([色涩铯銫]|[sSｓＳ][^A-Za-z0-9_一-龥]{0,6}[eEｅＥēéěèê])[^一-龥]{0,6})?)|[成城大][^一-龥]{0,6}[人魜][^一-龥]{0,6}|[情请箐清青][^一-龥]{0,6}([色涩铯銫]|[sSｓＳ][^A-Za-z0-9_一-龥]{0,6}[eEｅＥēéěèê])[^一-龥]{0,6}|([色涩铯銫]|[sSｓＳ][^A-Za-z0-9_一-龥]{0,6}[eEｅＥēéěèê])[^一-龥]{0,6}[情请箐清青][^一-龥]{0,6}|激[^一-龥]{0,6}[情请箐清青][^一-龥]{0,6}|[aAａＡаАāáǎàɑ][^A-Za-z0-9_一-龥]{0,6}[vVｖＶ片带][^一-龥]{0,6})(电[^一-龥]{0,6}影|视[^一-龥]{0,6}频|录[^一-龥]{0,6}像|[ＭMmｍМΜMм㎡][^A-Za-z0-9_一-龥]{0,6}[oOｏＯōóǒò0０oOＯｏ○〇][^A-Za-z0-9_一-龥]{0,6}[vVｖＶ][^A-Za-z0-9_一-龥]{0,6}[iIｉＩīíǐì][^A-Za-z0-9_一-龥]{0,6}[eEｅＥēéěèê]|[fFｆＦ][^A-Za-z0-9_一-龥]{0,6}[iIｉＩīíǐì][^A-Za-z0-9_一-龥]{0,6}[lLｌＬ][^A-Za-z0-9_一-龥]{0,6}[ＭMmｍМΜMм㎡]|影[^一-龥]{0,6}片)',
u'((((激|卖|脱|拖)[^A-Za-z0-9_一-龥]{0,2}(情|身|衣|依|晴))|(自[^A-Za-z0-9_一-龥]?慰))[^A-Za-z0-9_一-龥]{0,2}(视|表|婊)[^A-Za-z0-9_一-龥]{0,2}(频|演|屏))|((视|表|婊)[^A-Za-z0-9_一-龥]{0,2}(频|演|屏)[^A-Za-z0-9_一-龥]{0,2}(((激|卖|脱|拖)[^A-Za-z0-9_一-龥]{0,2}(情|身|衣|依|晴))|(自[^A-Za-z0-9_一-龥]?慰)))',
u'(#\d{2,3}){20,}',
u'([^A-Za-z0-9_一-龥+.。])\1{20,}',
u'(系[^一-龥]{0,3}[统統]|公[^一-龥]{0,3}[告吿]|布[^一-龥]{0,3}[告吿]|通[^一-龥]{0,3}[告吿知])',
u'奥[^一-龥]{0,6}巴[^一-龥]{0,6}马|台[^一-龥]{0,6}湾[^一-龥]{0,6}岛[^一-龥]{0,6}国[^一-龥]{0,6}万[^一-龥]{0,6}岁|西[^一-龥]{0,6}藏[^一-龥]{0,6}分[^一-龥]{0,6}裂|西[^一-龥]{0,6}藏[^一-龥]{0,6}国|新[^一-龥]{0,6}疆[^一-龥]{0,6}分[^一-龥]{0,6}裂|新[^一-龥]{0,6}疆[^一-龥]{0,6}国|一[^一-龥]{0,6}中[^一-龥]{0,6}一[^一-龥]{0,6}台|藏[^一-龥]{0,6}妇[^一-龥]{0,6}会|轮[^一-龥]{0,6}奸|强[^一-龥]{0,6}奸|反[^一-龥]{0,6}共[^一-龥]{0,6}反[^一-龥]{0,6}党|暴[^一-龥]{0,6}动|赌[^一-龥]{0,6}博|开[^一-龥]{0,6}房|走[^一-龥]{0,6}私|一[^一-龥]{0,6}夜[^一-龥]{0,6}情|抽[^一-龥]{0,6}头|卖[^一-龥]{0,6}淫|大[^一-龥]{0,6}麻',
u'傻[^一-龥]{0,6}逼|bitch|shit',
u'[茉末莫沫][^一-龥]{0,6}[莉利丽莉荔][^一-龥]{0,6}花|molihua|三[^一-龥]{0,6}号[^一-龥]{0,6}套[^一-龥]{0,6}餐|[两俩][^一-龥]{0,6}会',
u'习[^一-龥]*[近主][^一-龥]*[平席]|[博薄][^一-龥]*[西书熙][^一-龥]*[记来]|周[^一-龥]*永[^一-龥]*[康k]|吴[^一-龥]*邦[^一-龥]*国',
u'([反灭]|打[^一-龥]*[倒到]|推[^一-龥]*翻)[^一-龥]*([华華]|[共工][^一-龥]*[产產浐]|政[^一-龥]*府|社[^一-龥]*[会會])',
u'[党黨谠傥噹當][^一-龥]*([匪费篚扉狗猪]|灭王|下台|分裂|垮台|内讧|大乱|独裁|专政|末年|倒台)',
u'([爆灭操潮抄叼刁掉干靠透插日摸丢吊草搞超朝曹滚曰打]|反[^一-龥]*对|鄙[^一-龥]*视)[^一-龥]*(中[^一-龥]*[国华國華共党]|[共工][^一-龥]*[产產浐][^一-龥]*[党黨裆谠傥])',
u'(中[^一-龥]*国?[^一-龥]*[共央]|共[^一-龥]*[党黨裆谠傥]|中[^一-龥]*[国國華][^一-龥]*共[^一-龥]*产[^一-龥]*[党黨裆谠傥])[^一-龥]*(下[^一-龥]*台|镇压.*人权|收[^一-龥]*皮|[屎倒])|退党大潮|九评共产党|政府.*无能',
u'(tai|台|臺|藏|疆|自由|突厥|西藏|台湾|圣火|奥运)[^一-龥]*(独|du|DU|独立|革命|西藏|局势|中断|受扰|抗议|示威)|国[^一-龥]*民[^一-龥]*[党当]|东[^一-龥]*亚[^一-龥]*病[^一-龥]*夫|(日本|大和)[^一-龥]*(鬼子|帝国|天皇|民族)',
u'日本猪|太阳旗|打倒共肥|自焚事件|中(共|gong)太(子|zi)[裆党]|公安[局菊]长|茉莉花革命|暴[动徒政]',
u'退党|反[^一-龥]*华|一党独裁|一党专政|游行示威|中共独裁|茉[^一-龥]{0,8}莉[^一-龥]{0,8}花?[^一-龥]{0,8}革[^一-龥]{0,8}命|人权大于主权|中国茉莉花|(茉莉花.*(集会|口号|革命))|((推翻|打[倒到]|取消).*(暴政|党))',
u'([法珐琺砝發发鍅]|[fFｆＦ][aAａＡ]|三去)[^一-龥]*([轮論輪倫侖綸掄淪崙崘惀腀论伦沦仑纶抡囵倫綸綸腀淪]|[lLｌＬ][uUｕＵ][nNｎＮ]|车仑)[^一-龥]*([功工共龚公供宫攻供拱弓恭共达大汏]|[dDｄＤ][aAａＡ])',
u'(([法珐琺砝鍅]|[fFｆＦ][aAａＡ]|三去)[^一-龥]*([西希夕]|[XxＸｘ][IiｉＩ])[^一-龥]*([斯撕嘶]|[sSｓＳ][IiｉＩ]))|([fFｆＦ][^A-Za-z0-9_一-龥]*[aAａＡ][^A-Za-z0-9_一-龥]*[sSｓＳ][^A-Za-z0-9_一-龥]*[cCｃＣ][^A-Za-z0-9_一-龥]*[iIｉＩ][^A-Za-z0-9_一-龥]*[sSｓＳ][^A-Za-z0-9_一-龥]*[tTｔＴ])',
u'^(?!.*(([Cc藏Ｃｃ][^A-Za-zＡ-Ｚａ-ｚ一-龥]{0,3}[Bb宝Ｂｂ][^A-Za-zＡ-Ｚａ-ｚ一-龥]{0,3}[Gg阁Ｇｇ]?|玩家|功勋|税金|商票|验证|元宝|[{<}\[>\]]))).*(?=.*(交易|售|号|卖)).*([⑸⒌5５五无伍吴⑤㈤巫无舞网武][^A-Za-zＡ-Ｚａ-ｚ一-龥]{0,3}[⑴⒈1l１iIｉ!Ｉ壹依一一㈠①妖艺药幺][^A-Za-zＡ-Ｚａ-ｚ]{0,5}[⑺⒎7７漆柒妻七七⑦㈦气其棋骑银][^A-Za-zＡ-Ｚａ-ｚ一-龥]{0,5}[⑶⒊3３三伤三叁㈢③山行伞])',
u'(Touch|碎魂|龙武|斗仙|封天|剑网3|剑网三|神武|桃园|英雄联盟|剑灵|逆战飞车|炫舞|斗战神|天龙八部|穿越火线|魔兽世界|地下城与勇士|Tera|魔域|龙剑|兵王|天堂2|激战2|永恒之塔|时[^A-Za-zＡ-Ｚａ-ｚ０-９0-9一-龥]{0,3}空[^A-Za-zＡ-Ｚａ-ｚ０-９0-9一-龥]{0,3}裂[^A-Za-zＡ-Ｚａ-ｚ０-９0-9一-龥]{0,3}痕|神鬼传奇|诺亚传说|巫师之怒|上古世纪传奇征途|征[^A-Za-zＡ-Ｚａ-ｚ０-９0-9一-龥]{0,3}途2S|鹿鼎记|功夫英雄|铁血大宋|剑侠世界|笑[^A-Za-zＡ-Ｚａ-ｚ０-９0-9一-龥]{0,3}傲[^A-Za-zＡ-Ｚａ-ｚ０-９0-9一-龥]{0,3}江[^A-Za-zＡ-Ｚａ-ｚ０-９0-9一-龥]{0,3}湖|九阴真经|远征|仙途|诛仙2|画皮2|星辰变|神仙传|神仙世界|御龙在天|完美国际|仙侠世界|传奇世界|斩魂|刀剑|忍龙|暗黑3|刀剑2|征途|冒险岛|龙之谷|QQ仙境|艾尔之光|黎明之光|C9第九大陆|洛奇英雄传|问道|劲舞团|QQ仙灵|东方故事|麻辣江湖|神雕侠侣|梦幻诛仙|桃花源记|新水浒Q传|DOTA|星际2|DOTA2|梦三国|NBA2KOL|街头篮球|自由篮球|FIFA\s*OL3|炫斗之王|跑跑卡丁车|九天传|三国演义|晴空物语|无尽英雄|天龙群侠|源火|画皮|龙之幻想|天羽外传|大决战|颓废之心|新问鼎|蜀山剑侠传|坠星大陆|完美西游|神劫).*([公内封][^A-Za-zＡ-Ｚａ-ｚ０-９0-9一-龥]{0,3}测|测试|验[^A-Za-zＡ-Ｚａ-ｚ０-９0-9一-龥]{0,2}证[^A-Za-zＡ-Ｚａ-ｚ０-９0-9一-龥]{0,2}码|激[^A-Za-zＡ-Ｚａ-ｚ０-９0-9一-龥]{0,3}活[^A-Za-zＡ-Ｚａ-ｚ０-９0-9一-龥]{0,3}码|开服|火爆|招暮)',
u'([公内封][^A-Za-zＡ-Ｚａ-ｚ０-９0-9一-龥]{0,3}测|测试|验[^A-Za-zＡ-Ｚａ-ｚ０-９0-9一-龥]{0,2}证[^A-Za-zＡ-Ｚａ-ｚ０-９0-9一-龥]{0,2}码|激[^A-Za-zＡ-Ｚａ-ｚ０-９0-9一-龥]{0,3}活[^A-Za-zＡ-Ｚａ-ｚ０-９0-9一-龥]{0,3}码|开服|火爆|招暮).*(Touch|碎魂|龙武|斗仙|封天|剑网3|剑网三|神武|桃园|英雄联盟|剑灵|逆战飞车|炫舞|斗战神|天龙八部|穿越火线|魔兽世界|地下城与勇士|Tera|魔域|龙剑|兵王|天堂2|激战2|永恒之塔|时[^A-Za-zＡ-Ｚａ-ｚ０-９0-9一-龥]{0,3}空[^A-Za-zＡ-Ｚａ-ｚ０-９0-9一-龥]{0,3}裂[^A-Za-zＡ-Ｚａ-ｚ０-９0-9一-龥]{0,3}痕|神鬼传奇|诺亚传说|巫师之怒|上古世纪传奇征途|征[^A-Za-zＡ-Ｚａ-ｚ０-９0-9一-龥]{0,3}途2S|鹿鼎记|功夫英雄|铁血大宋|剑侠世界|笑[^A-Za-zＡ-Ｚａ-ｚ０-９0-9一-龥]{0,3}傲[^A-Za-zＡ-Ｚａ-ｚ０-９0-9一-龥]{0,3}江[^A-Za-zＡ-Ｚａ-ｚ０-９0-9一-龥]{0,3}湖|九阴真经|远征|仙途|诛仙2|画皮2|星辰变|神仙传|神仙世界|御龙在天|完美国际|仙侠世界|传奇世界|斩魂|刀剑|忍龙|暗黑3|刀剑2|征途|冒险岛|龙之谷|QQ仙境|艾尔之光|黎明之光|C9第九大陆|洛奇英雄传|问道|劲舞团|QQ仙灵|东方故事|麻辣江湖|神雕侠侣|梦幻诛仙|桃花源记|新水浒Q传|DOTA|星际2|DOTA2|梦三国|NBA2KOL|街头篮球|自由篮球|FIFA\s*OL3|炫斗之王|跑跑卡丁车|九天传|三国演义|晴空物语|无尽英雄|天龙群侠|源火|画皮|龙之幻想|天羽外传|大决战|颓废之心|新问鼎|蜀山剑侠传|坠星大陆|完美西游|神劫)',
u'多[^A-Za-zＡ-Ｚａ-ｚ０-９0-9一-龥]{0,4}玩.*激[^A-Za-zＡ-Ｚａ-ｚ０-９0-9一-龥]{0,4}活[^A-Za-zＡ-Ｚａ-ｚ０-９0-9一-龥]{0,4}码|激[^A-Za-zＡ-Ｚａ-ｚ０-９0-9一-龥]{0,4}活[^A-Za-zＡ-Ｚａ-ｚ０-９0-9一-龥]{0,4}码.*多[^A-Za-zＡ-Ｚａ-ｚ０-９0-9一-龥]{0,4}玩',
u'^(?!.*(\[|\]|\}|\{|[客情陈钱])).*(圣[^一-龥]*斗[^一-龥]*士[^一-龥]*星[^一-龥]*矢|斗[^一-龥]*破[^一-龥]*苍[^一-龥]*穹|斗[^一-龥]*战[^一-龥]*神|剑[^一-龥]*灵|九[^一-龥]*阴[^一-龥]*真[^一-龥]*经|行[^一-龥]*星[^一-龥]*边[^一-龥]*际|剑[^一-龥]*侠)',
u'[共工][^一-龥]*[产產浐]|[共工][^一-龥]*[匪费篚扉狗猪]|反[^一-龥]*[共工]|[中肿][^一-龥]*共',
u'([法珐琺砝鍅]|[fFｆＦ][aAａＡ]|三去)[^一-龥]{0,10}([轮論輪倫侖綸掄淪崙崘惀腀论伦沦仑纶抡囵倫綸綸腀淪]|[lLｌＬ][uUｕＵ][nNｎＮ]|车仑)',
u'百[^一-龥]*家[^一-龥]*乐|催[^一-龥]*情[^一-龥]*药|达[^一-龥]*菲[^一-龥]*鸡|黑[^一-龥]*帮|吉[^一-龥]*跋[^一-龥]*猫|菊[^一-龥]*花[^一-龥]*蚕|老[^一-龥]*虎[^一-龥]*机|六[^一-龥]*合[^一-龥]*彩|迷[^一-龥]*奸[^一-龥]*药|潜[^一-龥]*烈[^一-龥]*蟹|三[^一-龥]*唑[^一-龥]*仑|尾[^一-龥]*申[^一-龥]*鲸|雅[^一-龥]*蠛[^一-龥]*蝶|吟[^一-龥]*稻[^一-龥]*雁|赚[^一-龥]*黑[^一-龥]*钱|鹳[^一-龥]*狸[^一-龥]*猿|学[^一-龥]*潮|邪[^一-龥]*教|倭[^一-龥]*寇|树[^一-龥]*猪|手[^一-龥]*淫|日[^一-龥]*货|人[^一-龥]*权|卖[^一-龥]*国[^一-龥]*贼|九[^一-龥]*评|汉[^一-龥]*奸|反[^一-龥]*日|黑[^一-龥]*社[^一-龥]*会',
u'大[^一-龥]*[纪紀][^一-龥]*元|[党黨裆谠傥][^一-龥]*中[^一-龥]*央|法[^一-龥]*克[^一-龥]*鱿|回[^一-龥]*民|六[^一-龥]*四[^一-龥]*运[^一-龥]*动|轮[^一-龥]*功|民[^一-龥]*主[^一-龥]*[党黨裆谠傥]|四[^一-龥]*人[^一-龥]*帮|台[^一-龥]*湾[^一-龥]*[国國華]|支[^一-龥]*那|中[^一-龥]*华[^一-龥]*民[^一-龥]*[国國華]|腾[^一-龥]*讯',
u'政[^一-龥]*府|中[^一-龥]*央|抗[^一-龥]*日|国[^一-龥]*务|政[^一-龥]*治|中[^一-龥]*南[^一-龥]*海|宪[^一-龥]*章|总[^一-龥]*理|吸[^一-龥]*毒|本[^一-龥]*拉[^一-龥]*登|妓[^一-龥]*院|康[^一-龥]*生|主[^一-龥]*席|书[^一-龥]*记|天[^一-龥]*安[^一-龥]*门|文[^一-龥]*化[^一-龥]*局|版[^一-龥]*署|警[^一-龥]*察|解[^一-龥]*放[^一-龥]*军|公[^一-龥]*安',
u'^(?!.*(.)\1{3,})[QqqｑＱ扣寇抠歪ＹYyｙУ歪]{1,}群?[\d]{5,15}(?!\d)',
u'江[^一-龥]*泽[^一-龥]*民|朱[^一-龥]*[容镕][^一-龥]*基|胡[^一-龥]*[帛锦淿][^一-龥]*[寿涛]|邓[^一-龥]*小[^一-龥]*平|胡[^一-龥]*德[^一-龥]*平|迟[^一-龥]*浩[^一-龥]*田|池[^一-龥]*维[^一-龥]*生|陈[^一-龥]*(存[^一-龥]*根|丹[^一-龥]*淮|光[^一-龥]*[成诚]|华|际[^一-龥]*瓦|建[^一-龥]*安|良[^一-龥]*[军宇]|明|全[^一-龥]*国|胜|同[^一-龥]*海|伟[^一-龥]*[兰力]|文[^一-龥]*清|西|希[^一-龥]*同|泱[^一-龥]*潮|雨[^一-龥]*露|政[^一-龥]*高|知[^一-龥]*非|知[^一-龥]*[健庶涯]|子[^一-龥]*和|永)',
u'd[^一-龥0-9０-９ａ-ｚＡ-ＺA-Za-z]{0,}a[^一-龥0-9０-９ａ-ｚＡ-ＺA-Za-z]{0,}j[^一-龥0-9０-９ａ-ｚＡ-ＺA-Za-z]{0,}i[^一-龥0-9０-９ａ-ｚＡ-ＺA-Za-z]{0,}y[^一-龥0-9０-９ａ-ｚＡ-ＺA-Za-z]{0,}u[^一-龥0-9０-９ａ-ｚＡ-ＺA-Za-z]{0,}a[^一-龥0-9０-９ａ-ｚＡ-ＺA-Za-z]{0,}n|l[^一-龥0-9０-９ａ-ｚＡ-ＺA-Za-z]{0,}i[^一-龥0-9０-９ａ-ｚＡ-ＺA-Za-z]{0,}h[^一-龥0-9０-９ａ-ｚＡ-ＺA-Za-z]{0,}o[^一-龥0-9０-９ａ-ｚＡ-ＺA-Za-z]{0,}n[^一-龥0-9０-９ａ-ｚＡ-ＺA-Za-z]{0,}g[^一-龥0-9０-９ａ-ｚＡ-ＺA-Za-z]{0,}z[^一-龥0-9０-９ａ-ｚＡ-ＺA-Za-z]{0,}h[^一-龥0-9０-９ａ-ｚＡ-ＺA-Za-z]{0,}i|G[^一-龥0-9０-９ａ-ｚＡ-ＺA-Za-z]{0,}C[^一-龥0-9０-９ａ-ｚＡ-ＺA-Za-z]{0,}D',
u'(?<![^A-Za-zＡ-Ｚａ-ｚ0-9０-９一-龥])[wWｗＷ]{3,3}([⒈-⒛\.點点。·．,丶` ])(?![^A-Za-zＡ-Ｚａ-ｚ0-9０-９一-龥])',
u'[kKｋＫ][^一-龥]*粉|[搖摇][^一-龥]*[頭头][^一-龥]*丸|海[^一-龥]*洛[^一-龥]*因|[鸦鴉][^一-龥]*片|可[^一-龥]*卡[^一-龥]*因|冰[^一-龥]*毒|迷[^一-龥]*幻[^一-龥]*[药藥]|迷[^一-龥]*[药藥]|嗨[^一-龥]*[药藥]|春[^一-龥]*[药藥]|迷[^一-龥]*魂[^一-龥]*[药水]',
u'安[^一-龥]*倍[^一-龥]*晋[^一-龥]*三|陈[^一-龥]*昌[^一-龥]*智|陈[^一-龥]*至[^一-龥]*立|达[^一-龥]*赖|东[^一-龥]*条[^一-龥]*英[^一-龥]*机|恩[^一-龥]*格[^一-龥]*斯|回[^一-龥]*良[^一-龥]*玉|江[^一-龥]*青|蒋[^一-龥]*介[^一-龥]*石|蒋[^一-龥]*经[^一-龥]*国|蒋[^一-龥]*树[^一-龥]*声|蒋[^一-龥]*中[^一-龥]*正|李[^一-龥]*洪[^一-龥]*志|列[^一-龥]*宁|林[^一-龥]*彪|林[^一-龥]*立[^一-龥]*果|隆[^一-龥]*美[^一-龥]*尔|马[^一-龥]*克[^一-龥]*思|墨[^一-龥]*索[^一-龥]*里[^一-龥]*尼|孙[^一-龥]*中[^一-龥]*山|松[^一-龥]*井[^一-龥]*石[^一-龥]*根|天[^一-龥]*皇|希[^一-龥]*特[^一-龥]*勒|小[^一-龥]*泉[^一-龥]*纯[^一-龥]*一|姚[^一-龥]*文[^一-龥]*元|张[^一-龥]*春[^一-龥]*桥|李[^一-龥]*长[^一-龥]*春|李[^一-龥]*瑞[^一-龥]*环|尉[^一-龥]*健[^一-龥]*行|李[^一-龥]*岚[^一-龥]*清|宋[^一-龥]*祖[^一-龥]*英|曾[^一-龥]*庆[^一-龥]*红|黄[^一-龥]*菊|罗[^一-龥]*干|吴[^一-龥]*官[^一-龥]*正|贾[^一-龥]*庆[^一-龥]*林|赵[^一-龥]*紫[^一-龥]*阳|白[^一-龥]*克[^一-龥]*明|薄[^一-龥]*熙[^一-龥]*成|薄[^一-龥]*熙[^一-龥]*来|薄[^一-龥]*一[^一-龥]*波|曹[^一-龥]*建[^一-龥]*明|曾[^一-龥]*海[^一-龥]*生|曾[^一-龥]*庆[^一-龥]*洋|曾[^一-龥]*庆[^一-龥]*源|陈[^一-龥]*昊[^一-龥]*苏|戴[^一-龥]*秉[^一-龥]*国|邓[^一-龥]*林|邓[^一-龥]*楠|邓[^一-龥]*朴[^一-龥]*方|邓[^一-龥]*榕|邓[^一-龥]*先[^一-龥]*群|邓[^一-龥]*质[^一-龥]*方|耿[^一-龥]*飚|谷[^一-龥]*开[^一-龥]*来|谷[^一-龥]*牧|郭[^一-龥]*伯[^一-龥]*雄|韩[^一-龥]*启[^一-龥]*德|何[^一-龥]*光[^一-龥]*炜|贺[^一-龥]*平|胡[^一-龥]*耀[^一-龥]*邦|华[^一-龥]*国[^一-龥]*锋|华[^一-龥]*建[^一-龥]*敏|黄[^一-龥]*敬|黄[^一-龥]*镇|江[^一-龥]*绵[^一-龥]*恒|江[^一-龥]*绵[^一-龥]*康|孔[^一-龥]*原',
u'李[^一-龥]*干[^一-龥]*成|李[^一-龥]*桁|李[^一-龥]*建[^一-龥]*国|李[^一-龥]*克[^一-龥]*强|李[^一-龥]*敏|李[^一-龥]*讷|李[^一-龥]*铁[^一-龥]*林|李[^一-龥]*维[^一-龥]*汉|李[^一-龥]*先[^一-龥]*念|李[^一-龥]*小[^一-龥]*琳|李[^一-龥]*小[^一-龥]*鹏|李[^一-龥]*源[^一-龥]*潮|栗[^一-龥]*前[^一-龥]*明|梁[^一-龥]*光[^一-龥]*烈|廖[^一-龥]*承[^一-龥]*志|廖[^一-龥]*晖|林[^一-龥]*炎[^一-龥]*志|刘[^一-龥]*会[^一-龥]*远|刘[^一-龥]*平[^一-龥]*平|刘[^一-龥]*瑞[^一-龥]*龙|刘[^一-龥]*少[^一-龥]*奇|刘[^一-龥]*思[^一-龥]*齐|刘[^一-龥]*亭[^一-龥]*亭|刘[^一-龥]*维[^一-龥]*明|刘[^一-龥]*亚[^一-龥]*洲|刘[^一-龥]*延[^一-龥]*东|刘[^一-龥]*源|刘[^一-龥]*允[^一-龥]*真|路[^一-龥]*甬[^一-龥]*祥|马[^一-龥]*凯|毛[^一-龥]*岸[^一-龥]*青|毛[^一-龥]*新[^一-龥]*宇|毛[^一-龥]*远[^一-龥]*新|孟[^一-龥]*建[^一-龥]*柱|彭[^一-龥]*钢|桑[^一-龥]*国[^一-龥]*卫|邵[^一-龥]*华|田[^一-龥]*成[^一-龥]*平|万[^一-龥]*季[^一-龥]*飞|万[^一-龥]*里|汪[^一-龥]*道[^一-龥]*涵',
u'汪[^一-龥]*光[^一-龥]*焘|汪[^一-龥]*静[^一-龥]*香|王[^一-龥]*光[^一-龥]*英|王[^一-龥]*洛[^一-龥]*林|王[^一-龥]*岐[^一-龥]*山|王[^一-龥]*胜[^一-龥]*俊|王[^一-龥]*维[^一-龥]*滨|王[^一-龥]*维[^一-龥]*延|王[^一-龥]*兆[^一-龥]*国|王[^一-龥]*震|温[^一-龥]*家[^一-龥]*宝|温[^一-龥]*如[^一-龥]*春|温[^一-龥]*云[^一-龥]*松|乌[^一-龥]*云[^一-龥]*其[^一-龥]*木[^一-龥]*格|吴[^一-龥]*建[^一-龥]*常|习[^一-龥]*近[^一-龥]*平|习[^一-龥]*仲[^一-龥]*勋|徐[^一-龥]*才[^一-龥]*厚|严[^一-龥]*隽[^一-龥]*琪|姚[^一-龥]*依[^一-龥]*林|俞[^一-龥]*强[^一-龥]*声|俞[^一-龥]*正[^一-龥]*声|张[^一-龥]*爱[^一-龥]*萍|张[^一-龥]*德[^一-龥]*江|张[^一-龥]*宏|郑[^一-龥]*耀[^一-龥]*文|周[^一-龥]*秉[^一-龥]*建|周[^一-龥]*建[^一-龥]*南|周[^一-龥]*铁[^一-龥]*农|周[^一-龥]*小[^一-龥]*川|朱[^一-龥]*和[^一-龥]*平|朱[^一-龥]*燕[^一-龥]*来|朱[^一-龥]*云[^一-龥]*来|李[^一-龥]*鹏|毛[^一-龥]*泽[^一-龥]*东|周[^一-龥]*恩[^一-龥]*来',
u'赤[^一-龥]*[匪共]|毛[^一-龥]*润[^一-龥]*之|八[^一-龥]*月[^一-龥]*十[^一-龥]*五[^一-龥]*杀[^一-龥]*鞑[^一-龥]*子|白[^一-龥]*东[^一-龥]*平|爆[^一-龥]*冲[^一-龥]*突|爆[^一-龥]*破[^一-龥]*剂[^一-龥]*出[^一-龥]*售|爆[^一-龥]*竹[^一-龥]*送[^一-龥]*货[^一-龥]*上[^一-龥]*门|北[^一-龥]*戴[^一-龥]*河[^一-龥]*督[^一-龥]*抚[^一-龥]*朝[^一-龥]*圣[^一-龥]*驾|北[^一-龥]*天[^一-龥]*门[^一-龥]*没[^一-龥]*开[^一-龥]*一[^一-龥]*枪|日[^一-龥]*内[^一-龥]*瓦[^一-龥]*宣[^一-龥]*言|不[^一-龥]*良[^一-龥0-9０-９ａ-ｚＡ-ＺA-Za-z]*q[^一-龥0-9０-９ａ-ｚＡ-ＺA-Za-z]*q[^一-龥0-9０-９ａ-ｚＡ-ＺA-Za-z]*图[^一-龥]*片|不[^一-龥]*愿[^一-龥]*做[^一-龥]*奴[^一-龥]*隶[^一-龥]*的[^一-龥]*人|布[^一-龥]*尔[^一-龥]*什[^一-龥]*维[^一-龥]*克|布[^一-龥]*假[^一-龥]*戏[^一-龥]*骗[^一-龥]*百[^一-龥]*姓|惨[^一-龥]*遭[^一-龥]*劳[^一-龥]*教',
u'苍[^一-龥]*炎[^一-龥]*九[^一-龥]*三|藏[^一-龥]*人[^一-龥]*自[^一-龥]*焚|藏[^一-龥]*字[^一-龥]*石|曹[^一-龥]*刚[^一-龥]*川|曹[^一-龥]*廷|常[^一-龥]*景[^一-龥]*强|朝[^一-龥]*日[^一-龥]*格[^一-龥]*图|朝[^一-龥]*闻[^一-龥]*通|城[^一-龥]*管[^一-龥]*秘[^一-龥]*笈|程[^一-龥]*虹|程[^一-龥]*连[^一-龥]*元|程[^一-龥]*万[^一-龥]*玉|池[^一-龥]*强|抽[^一-龥]*奖[^一-龥]*备[^一-龥]*案[^一-龥]*专[^一-龥]*线|爆[^一-龥]*破[^一-龥]*剂|出[^一-龥]*售[^一-龥]*爆[^一-龥]*竹',
u'支[^一-龥]*付[^一-龥]*[宝寶]|(淘|tao)[^一-龥ａ-ｚＡ-ＺA-Za-z]*(bao|[宝寶])|[售甩卖买出收][０-９0-9一二三四五六七八九十壹貮叁肆伍陆柒捌玖拾]{2,4}|[售甩卖买出收].*(金[^一-龥ａ-ｚＡ-ＺA-Za-z]*[券币B]|[yY游遊][^一-龥ａ-ｚＡ-ＺA-Za-z]*[xX戏戲][^一-龥ａ-ｚＡ-ＺA-Za-z]*[bB币])|(?<![0-9０-９])[⑸⒌5５五⑤㈤武][^一-龥0-9０-９ａ-ｚＡ-ＺA-Za-z]*[1⑴⒈１IＩI壹依一一㈠①妖艺药幺][^一-龥0-9０-９ａ-ｚＡ-ＺA-Za-z]*[⑺⒎7７柒七七⑦㈦][^一-龥0-9０-９ａ-ｚＡ-ＺA-Za-z]*[⑶⒊3３三三叁㈢③山](?![0-9０-９])|(金[^一-龥ａ-ｚＡ-ＺA-Za-z]*[券币B]|[yY游遊][^一-龥ａ-ｚＡ-ＺA-Za-z]*[xX戏戲][^一-龥ａ-ｚＡ-ＺA-Za-z]*[bB币]).*[售甩卖买出收]',
]


if __name__ == '__main__':
	import time

	st = time.time()
	initFilter()
	print 'initFilter', time.time() - st

	names = [
		u' 1',
		u'毛泽东',
		u'藏 独',
		u'草泥马',
		u'操你妈',
		u'av',
		u'1024',
		u'1024bb',
		u'陌上丶花开',
		u'He先森丶',
		u'xx毛泽东xxx',
	]

	for name in names:
		print filterName(name)

	st = time.time()
	n = 10000
	for i in xrange(n):
		for name in names:
			filterName(name)

	cost = time.time() - st
	print 'filterName', cost, 's', cost/n*1000, 'ms'