-- Copyright (c) 2014 YouMi Information Technology Inc.
-- Copyright (c) 2017 TianJi Information Technology Inc.
--
return {
	names = { '真纪', '美沙', '翔子', '里奈', '凉', '里代', '千春', '智沙', '直子', '友美', '七惠', '丽', '真白', '纪子', '工美', '梨香', '琴美', '未央', '佐和子', '贵子', '裕子', '美惠子', '峰子', '奈绪美', '顺子', '千裕', '香织', '加穗里', '淳子', '瞳', '芽衣', '沙树', '丽子', '由贵', '久美子', '有未', '明美', '惠利香', '加奈子', '留美', '优子', '弥代', '芳子', '晴美', '绘里', '理沙', '理惠子', '美智子', '麻矢', '未来', '桃子', '五月', '阳太', '苍介', '拓真', '英士', '邦彦', '千夜', '弘树', '修一', '千棠', '冰叶', '冥夜', '冰木原', '大树', '毅', '俊介', '洋介', '秀雄', '英明', '明义', '芳明', '和夫', '一雄', '和弘', '和义', '一辉', '英生', '浩', '宏夫', '裕生', '弘明', '洋明', '秀树', '英辉', '敏明', '寿明', '敏夫', '一', '一郎', '次郎', '小次郎', '太郎', '三郎', '龙太郎', '丸', '翔太', '飒', '飒太', '健', '结弦', '田英', '泷', '雅', '泽', '仁', '新一', '秀中', '龙井', '银时', '上二', '秀一', '隆一', '翔平' },
	nameCenters = { '' },
	namePrefixs = { '千手', '宇智波', '大筒木', '漩涡', '水无月', '鬼灯', '猿飞', '山中', '奈良', '秋道', '志村', '波风', '月光', '竹取', '日向', '旗木', '春野', '不知火', '油女', '夕日', '水户', '转寝', '鞍马', '迈特', '犬冢', '森乃', '桃地', '辉夜', '神月', '海野', '药师', '加藤' },
}
